import pytest

from task_1 import task_1_3


@pytest.mark.parametrize(
    "d, expected",
    [
        (
            [
                "python",
            ],
            {1: 1.00},
        ),
        (
            [
                "смотреть сериалы онлайн",
                "новости спорта",
                "афиша кино",
            ],
            {2: 0.67, 3: 0.33},
        ),
        (
            [
                "смотреть сериалы онлайн",
                "новости спорта",
                "кино",
            ],
            {1: 0.33, 2: 0.33, 3: 0.33},
        ),
        (
            [
                "смотреть сериалы онлайн без регистрации и смс",
                "новости спорта сегодня и завтра",
                "кино фантастика",
                "python",
                "1 2 3",
            ],
            {1: 0.2, 2: 0.2, 3: 0.2, 5: 0.2, 7: 0.2},
        ),
    ],
)
def test_task1_3(d, expected):
    assert task_1_3(d) == expected
